Laurenceb/STM32_Launcher/main.c
		//This processes and checks the actual launch command
		if( UplinkFlags&(1<<(LAUNCH_PERMISSION)) && !permission_time) {
			permission_time=Millis+PERMISSION_DURATION;//The permission command allows a launch to proceed at any point in this time window
			Ignition_Selftest=0;		//Reset this
			UplinkFlags&=~((1<<(LAUNCH_COMMAND))|(1<<(CUTDOWN_COMMAND)));//Makes sure that cut and ignition bits are wiped in case they were set by error
		}
		if( Millis<permission_time && permission_time ) {//Load the Flag bits during the permission time
			UplinkFlags&=~(0x07<<IGNITION_FLAG_BITS);//Wipe the bits first
			UplinkFlags|=(Ignition_Selftest&0x07)<<IGNITON_FLAG_BITS;//This should change from 0 to 1 following a launch,or 2 or 3 if autosequence fails
			if( UplinkFlags&(1<<(LAUNCH_COMMAND)) && Millis<(permission_time-PERMISSION_HOLD)) {//Need to send the command whilst the permission is valid
				UplinkFlags&=~(1<<(LAUNCH_COMMAND));//Wipe the bit
				if( ((gps.mslaltitude/1000) > (int32_t)LAUNCH_ALTITUDE) && ((Millis-badgyro)>LAUNCH_STABLE_PERIOD ) ) {
					countdown_time=Millis+COUNTDOWN_DELAY;
					GOPRO_TRIG_ON;		//Turn the GoPro on the record the launch, it runs an autoexec.ash script
				} else				//Launch refused
					UplinkFlags^=(1<<(LAUNCH_REFUSED));
			}
		}
		else {
			UplinkFlags&=~(1<<LAUNCH_PERMISSION);//Wipe the bit when time expires
			UplinkFlags&=~((1<<(LAUNCH_COMMAND))|(1<<(CUTDOWN_COMMAND)));//Makes sure that cut and ignition bits are wiped
			permission_time=0;		//Reset this to zero
		}
		if( countdown_time && Millis>(countdown_time-COUNTDOWN_DELAY+GOPRO_TRIGGER_TIME) )
			GOPRO_TRIG_OFF;
		if( countdown_time && Millis>countdown_time ) {
			countdown_time=0;
			AutoSequence=1;			//Go for launch
		}
		//Grab the data from the Gyro
		while(bytes_in_buff(&Gyro_x_buffer)) {
			uint16_t  data[4];
			data[0]=Pop_From_Buffer(&Gyro_x_buffer);
			data[1]=Pop_From_Buffer(&Gyro_y_buffer);
			data[2]=Pop_From_Buffer(&Gyro_z_buffer);
			uint32_t dummy_f=Pop_From_Buffer(&Gyro_aligned_rpm_buffer);
			int16_t dummy_i=(int16_t)*((float*)&dummy_f);//Grab as float then typecast to int16_t, then store as uint16_t
			data[3]=*(uint16_t*)&dummy_i;
			write_wave_samples(&FATFS_wavfile_gyro, 4, 16, &Gyro_wav_stuffer, (uint16_t*) data);//Put the raw data into the wav file
		}
		//Other sensors etc can go here
		//Check for changed data
		if(!I2C1error.error && (Millis-repetition_counter)<3500) {
			Watchdog_Reset();		//Reset the watchdog each main loop iteration if everything looks ok
			if(memcmp(L3GD20_Data_Buffer,L3GD20_Data_Buffer_old,sizeof(L3GD20_Data_Buffer))) //If data differs
				repetition_counter=Millis;
			memcpy(L3GD20_Data_Buffer_old,L3GD20_Data_Buffer,sizeof(L3GD20_Data_Buffer_old));//Copy for reference
		}
		else {
			uint8_t sensors_;
			do {
				I2C1error.error=0;	//Reset both of these
				repetition_counter=Millis;
				Completed_Jobs=0;	//Prevent any bus reads from running
				while(Jobs && Millis<(repetition_counter+20));//Wait for any jobs to finish (with timeout)
				Completed_Jobs=0;	//Ensure this is zeroed
				I2C_Config();		//Setup the I2C bus
				sensors_=detect_sensors(1);//Search for connected sensors -argument means the i2c data output buffers are not reinitialised
				Delay(100000);
				//If it didn't work the first time - call the preallocator to force a file sync, saving all data
				if((sensors_&(1<<L3GD20_CONFIG))!=(1<<L3GD20_CONFIG)) {	
					f_sync(&FATFS_logfile);
					f_sync(&FATFS_wavfile_gyro);
				}			//Loop forever if we dont find correct sensors - watchdog will kill us in the end
			} while((sensors_&(1<<L3GD20_CONFIG))!=(1<<L3GD20_CONFIG));
			sensors=sensors_;
			i2c_resets++;	
			Watchdog_Reset();		//Recovered ok, so reset
		}
		//Button multipress status
		if(System_state_Global&0x80) {		//A "control" button press
			system_state=System_state_Global&~0x80;//Copy to local variable
			if(system_state==1)		//A single button press
				;//Function call can go here 
			if(system_state==2) {		//Double press -> function to wipe the landing position estimator BBRAM
				initialise_landing_estimator(&gps,1,descent);
				reset_counter=0;
				shutdown_lock=0;
				PWR_BackupAccessCmd(ENABLE);/* Allow access to BKP Domain */
				BKP_WriteBackupRegister(BKP_DR2,reset_counter);/* Reset the counter on ok boot when we are not running with the shutdown lock*/
				BKP_WriteBackupRegister(BKP_DR3,shutdown_lock);
				PWR_BackupAccessCmd(DISABLE);
			}
			else if(system_state==3)	//A triple button press will turn off the device even if it is in proper flight mode
				Shutdown_System=MULTIPRESS_TURNOFF;
			System_state_Global&=~0x80;	//Wipe the flag bit to show this has been processed
		}
		//Generate the Telemetry string
		if(Millis-last_telemetry>25000) {	//Every 25 seconds
			last_telemetry=Millis;
			rtc_gettime(&RTC_time);		//Get the RTC time and put a timestamp on the start of the file
			print_string[0]=0x00;		//Set string length to 0
			printf("$$%s,%d,%02d:%02d,%3f,%3f,%1f,%1f,%1f,%1f,%1f,%d,%d,%02x,%d,%02x",CALLSIGN,sentence_counter++,RTC_time.hour,RTC_time.min,(float)gps.latitude*1e-7,(float)gps.longitude*1e-7,(float)gps.mslaltitude*1e-3,Battery_Voltage,Temperature,Gyro_XY_Rate,Gyro_Z_Rate,Gyro_Temperature,UplinkBytes,UplinkFlags,Last_RSSI,CutFlags);
			uint16_t checksum=string_CRC16_checksum (print_string);//Generate the checksum
			printf("*%04x\n",checksum);
			send_string_to_silabs(print_string);//Output the string via the silabs
			uint8_t* endhead=strchr(print_string,',');//Find end of the header
			uint8_t* endstring=strchr(print_string,'*');//Find end of formatted string
			*endstring=0;	//End here also
			print_string[0]=0;
			printf("%d",Millis/1000);	
			memcpy(&print_string[strlen(print_string)],endhead,endstring-endhead+1);//Compress the contents backwards
			printf(",%02x\n",system_state|((i2c_resets<<6)&0xC0)|((si446x_resets<<4)&0x30));//Adds the state and newline to the end of the string
		}
		system_state=0;				//Reset this
		if((file_opened&0x01) &&strlen(print_string)) {
			f_puts(print_string,&FATFS_logfile);//Store the reformatted telemetry in the logfile
			print_string[0]=0x00;		//Set string length to 0
		}
		//Deal with file size - may need to preallocate some more
		file_preallocation_control(&FATFS_logfile);
		file_preallocation_control(&FATFS_wavfile_gyro);
                if((Shutdown_System&&(shutdown_lock!=SHUTDOWNLOCK_MAGIC))||(Shutdown_System==MULTIPRESS_TURNOFF)) {//A system shutdown has been requested
			if(file_opened)
				shutdown_filesystem(Shutdown_System, file_opened);
			if(Shutdown_System==USB_INSERTED)
				NVIC_SystemReset();	//Software reset of the system - USB inserted whilst running
			else {
				shutdown();		//Puts us into sleep mode
			}
		}
	}
}

/**
  * @brief  Writes a char to logfile
  * @param  Character to write
  * @retval None
  */
void __fat_print_char(char c) {
	f_write(&FATFS_logfile,&c,(UINT)1,&a);
}

/**
  * @brief  Writes a char to string - use for better logfile performance
  * @param  Character to write
  * @retval None
  */
void __str_print_char(char c) {
	uint8_t indx=strlen(print_string)%255;		//Make sure we cant overwrite ram
	print_string[indx]=c;				//Append string
	print_string[indx+1]=0x00;			//Null terminate
	__usart_send_char(c);				//Send to the bluetooth as well
}


/**
  * @brief  Detects which sensors are plugged in, inits buffers for attached peripheral sensors
  * @param  Init - pass zero to allow buffer initialisation
  * @retval Bitmask of detected sensors
  */
uint8_t detect_sensors(uint8_t init) {
        uint32_t millis = Millis;
	uint8_t sensors=0;
	SCHEDULE_CONFIG;				//Run the I2C devices config
	while(Jobs) {//while((I2C1->CR2)&(I2C_IT_EVT));//Wait for th i2c driver to complete
	  if(Millis>(millis+20))
	    return 0;
	}
	sensors=Completed_Jobs;				//Which I2C jobs completed ok?
	//Initialise the buffers if all is ok and we are allowed to
	if(!init && ((sensors&(1<<L3GD20_CONFIG))==(1<<L3GD20_CONFIG)) ) {
		Init_Buffer(&Gyro_x_buffer, 32);
		Init_Buffer(&Gyro_y_buffer, 32);
		Init_Buffer(&Gyro_z_buffer, 32);
		Init_Buffer(&Gyro_aligned_rpm_buffer, 32);
	}
	sensors|=test_cutdown(3)<<6;			//Upper two bits are the cutdowns
	return sensors;
}

/**
  * @brief  Ensures that we have significant preallocation on a file, useful to avoid significant delays on write
  * @param  Pointer to the file
  * @retval None
  */
void file_preallocation_control(FIL* file) {
	if(f_size(file)-f_tell(file)<(PRE_SIZE/2)) {	//More than half way through the pre-allocated area
		f_sync(file);				//Running a sync here minimizes risk of erranous data loss
		DWORD size=f_tell(file);
		f_lseek(file, f_size(file)+PRE_SIZE);	//Preallocate another PRE_SIZE
		f_lseek(file, size);			//Seek back to where we were before
	}
}

